#include "key.h"
/*
***********************************************************************************************
* 函数功能:按键初始化
* 函数形参: None
* 函数返回值: None
* 备注: None
* 作者: wriken
* 时间: 2019-08-21
* 修改作者: None
* 修改时间: None
***********/
void key_init(void)
{
		RCC->APB2ENR|=(0X1<<3);
		GPIOB->CRL&=~(0X3<<28);
		GPIOB->CRL|=(0x1<<30);
		
}
/*
***********************************************************************************************
* 函数功能:延时函数
* 函数形参: 延时微秒
* 函数返回值: None
* 备注: None
* 作者: wriken
* 时间: 2019-08-21
* 修改作者: None
* 修改时间: None
***********/
void key_delay(u32 time)
{
	time *=42;//42为1微妙
	while(time)
	{
		time--;
	}
}
